In [ ]:
import pandas as pd

df_pt1 = pd.read_csv('df_final_web_data_pt_1.txt')
df_pt2 = pd.read_csv('df_final_web_data_pt_2.txt')
df_experi = pd.read_csv('df_final_experiment_clients.txt')
df_demo = pd.read_csv('df_final_demo.txt')
pd.set_option('display.max_rows',1000)

In [13]:
df_pt1.isnull().sum()

client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

In [17]:
df_pt2.isnull().sum()

client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

In [11]:
# combine original 3 data files: df_pt1 + df_pt2 + final_experiment 
df_12 = pd.concat([df_pt1,df_pt2],ignore_index=True)
df_12

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04
...,...,...,...,...,...
755400,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:46:10
755401,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:45:29
755402,9668240,388766751_9038881013,922267647_3096648104_968866,step_1,2017-05-24 18:44:51
755403,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:44:34
755404,674799,947159805_81558194550,86152093_47511127657_716022,start,2017-06-03 12:17:09

In [19]:
df_merged_12_experi = pd.merge(df_12,df_experi, on='client_id',how='outer')
df_merged_12_experi

,client_id,visitor_id,visit_id,process_step,date_time,Variation
0,169,201385055_71273495308,749567106_99161211863_557568,confirm,2017-04-12 20:23:09,NaN
1,169,201385055_71273495308,749567106_99161211863_557568,step_3,2017-04-12 20:22:05,NaN
2,169,201385055_71273495308,749567106_99161211863_557568,step_2,2017-04-12 20:20:31,NaN
3,169,201385055_71273495308,749567106_99161211863_557568,step_1,2017-04-12 20:19:45,NaN
4,169,201385055_71273495308,749567106_99161211863_557568,start,2017-04-12 20:19:36,NaN
...,...,...,...,...,...,...
755400,9999875,738878760_1556639849,931268933_219402947_599432,step_3,2017-06-01 22:44:58,NaN
755401,9999875,738878760_1556639849,931268933_219402947_599432,step_2,2017-06-01 22:41:47,NaN
755402,9999875,738878760_1556639849,931268933_219402947_599432,step_1,2017-06-01 22:41:28,NaN
755403,9999875,738878760_1556639849,931268933_219402947_599432,step_1,2017-06-01 22:40:08,NaN
755404,9999875,738878760_1556639849,931268933_219402947_599432,start,2017-06-01 22:40:01,NaN

In [25]:
df_experi

       client_id Variation
0        9988021      Test
1        8320017      Test
2        4033851   Control
3        1982004      Test
4        9294070   Control
...          ...       ...
70604    2443347       NaN
70605    8788427       NaN
70606     266828       NaN
70607    1266421       NaN
70608    9895983       NaN

[70609 rows x 2 columns]

In [33]:
df_experi['client_id'].sort_values()

58722        169
14753        555
28357        647
50544        722
12828        934
          ...
37325    9999400
39046    9999626
21972    9999729
2317     9999832
56450    9999839
Name: client_id, Length: 70609, dtype: int64

In [31]:
df_demo['client_id'].sort_values()

59771        169
40126        555
1532         647
58466        722
13142        934
          ...
30538    9999400
3228     9999626
48756    9999729
8011     9999832
53845    9999839
Name: client_id, Length: 70609, dtype: int64

In [ ]:
df_experi_nonull = df_experi[df

In [23]:
df_experi.isnull().sum()

client_id        0
Variation    20109
dtype: int64

In [35]:
df_demo.isnull().sum()

client_id            0
clnt_tenure_yr      14
clnt_tenure_mnth    14
clnt_age            15
gendr               14
num_accts           14
bal                 14
calls_6_mnth        14
logons_6_mnth       14
dtype: int64

In [ ]:
threshold = 2  # Minimum number of non-NaN values required in a row
df_client_profiles_clean = df_client_profiles.dropna(thresh=threshold)

In [ ]:
# totally remove 10764 useless duplicatd rows from above 
df_merged_unique = df_merged_12_experi.drop_duplicates(keep='first')

In [ ]:
df_merged_unique_demo = pd.merge(df_merged_unique,df_demo, on='client_id',how='outer')

In [ ]:
df_merged_4files = df_merged_unique_demo.drop_duplicates(keep='first')

In [ ]:
# devide above last df into 2 group df( experient and non_experiment group)
df_expe     = df_merged_4files[df_merged_4files['Variation'].isna()]
df_non_expe = df_merged_4files[df_merged_4files['Variation'].notna()]

In [ ]:
# clean non experient group df: remove all those rows(112 rows) which value are null for anyone of below column:
df_non_expe_cleaned = df_non_expe.dropna(subset=['clnt_tenure_yr','clnt_tenure_mnth','clnt_age','gendr','num_accts','bal','calls_6_mnth','logons_6_mnth'])

In [ ]:
# clean experient group df
df_expe = df_expe[df_expe['gendr'] !='X']
df_expe.loc[df_expe['gendr']=='U','gendr']='Unknown'
df_expe.loc[df_expe['clnt_tenure_mnth']>12,'clnt_tenure_mnth']=df_expe['clnt_tenure_mnth'] % 12